       01  ACCOUNT-RECORD.
           05 ACCOUNT-ID               PIC 9(6).
           05 ACCOUNT-NAME             PIC X(30).
           05 ACCOUNT-TYPE             PIC X(10).
           05 ACCOUNT-BALANCE          PIC 9(9)V99.
           05 ACCOUNT-STATUS           PIC X(8).
           05 ACCOUNT-LAST-TRANSACTION PIC 9(8).
           05 ACCOUNT-CREATION-DATE    PIC 9(8).
