       01  TRANSACTION-RECORD.
           05  TRANSACTION-ID          PIC 9(6).
           05  TRANSACTION-DATE        PIC 9(8).
           05  ACCOUNT-ID              PIC 9(6).
           05  TRANSACTION-TYPE        PIC X(10).
           05  TRANSACTION-AMOUNT      PIC 9(9)V99.
